### Python MySQL

Python needs a MySQL driver to access the MySQL database.

In this tutorial we will use the driver "MySQL Connector"

Create Connection

Start by creating a connection to the database.

Use the username and password from your MySQL database:

In [39]:
import sql_connect

cursor, db =sql_connect.credentials()

Creatting Database

In [35]:
# cursor.execute("CREATE DATABASE fx")

In [36]:
cursor.execute("SHOW DATABASES")
for x in cursor:
    print (x)

('acquilafx',)
('customers',)
('fx',)
('information_schema',)
('kilimo',)
('moviesdb',)
('mysql',)
('performance_schema',)
('sys',)
('tecnobrain',)

## Create Table

In [37]:
cursor.execute ("USE fx")

In [40]:
# cursor.execute('CREATE TABLE eurusd (name VARCHAR(255), price float(34))')

## Primary Key

When creating a table, you should also create a column with a unique key for each record.

This can be done by defining a PRIMARY KEY.

We use the statement "INT AUTO_INCREMENT PRIMARY KEY" which will insert a unique number for each record. Starting at 1, and increased by one for each record.

In [ ]:
# since the table already exist, we use alter table

cursor.execute("ALTER TABLE EURUSD ADD COLUMN id INT AUTO_INCREMENT PRIMARY KEY")

Insert Into Table

To fill a table in MySQL, use the "INSERT INTO" statement.

Important!: Notice the statement: mydb.commit(). It is required to make the changes, otherwise no changes are made to the table.

In [ ]:
sql="INSERT INTO EURUSD (name, price) VALUES(%s,%s)"
val= ('used', 2345)
cursor.execute(sql, val)
db.commit() # saving the changes

In [ ]:
print(cursor.rowcount,"record inserted")

1 record inserted

### Insert Multiple Rows

To insert multiple rows into a table, use the executemany() method.

The second parameter of the executemany() method is a list of tuples, containing the data you want to insert:

In [ ]:
sql= "INSERT INTO EURUSD (name, price) VALUES(%s, %s)"
val= [('jpy', 2345),
      ('cad', 3564),
      ('ksh',130),
      ('tsh',2456)]
cursor.executemany(sql,val)
db.commit()
cursor.rowcount

4

### Get Inserted ID

You can get the id of the row you just inserted by asking the cursor object.

Note: If you insert more than one row, the id of the last inserted row is returned.

In [ ]:
sql= "INSERT INTO EURUSD (name, price) VALUES (%s, %s)"
val= ('ssd', 456)
cursor.execute(sql, val)
db.commit()

print('the row inserted ID IS ', cursor.lastrowid)

the row inserted ID IS  6

### Create Table with no auto primary keys 

1. Manually Assigning a Primary Key

Instead of using AUTO_INCREMENT, you can manually insert unique values
Note: when creating a table, the columns must be declared during creation

In [ ]:
# cursor.execute ("CREATE table orders ("
# "order_Id  INT PRIMARY KEY,"
# "product_name VARCHAR (255)"
# ",price INT)")

In [ ]:
# cursor.execute("show tables")
# for x in cursor:
#     print (x)

In [ ]:
# inserting info in orders table
"INSERT INTO orders (order_id,product_name, price) VALUES (1023, 'bitcoin', 345)"

"INSERT INTO orders (order_id,product_name, price) VALUES (1023, 'bitcoin', 345)"

 ### Using UUID Instead of Integer (For Distributed Systems)
If you need unique IDs across multiple databases, use UUID instead of AUTO_INCREMENT.

Using UUID as a Primary Key in MySQL for Distributed Databases

In distributed systems, UUID (Universally Unique Identifier) is often used as a primary key instead of AUTO_INCREMENT to ensure globally unique IDs across multiple servers.

In [ ]:
# cursor.execute ("CREATE TABLE users (user_id CHAR(36) PRIMARY KEY DEFAULT (UUID()), name VARCHAR (255))")

In [ ]:
# cursor.execute("INSERT INTO  users (name) VALUES ('thomas')")

In [ ]:
cursor.rowcount

0

### MySQL Select From

In [ ]:
# cursor.execute("SELECT * FROM eurusd")
# result= cursor.fetchall()

# for x in result:
#     print (x)

In [ ]:
cursor.rowcount

0

### Selecting Columns

To select only some of the columns in a table, use the "SELECT" statement followed by the column name(s):

In [ ]:
# cursor.execute ("SELECT name FROM eurusd")
# cursor.fetchmany(5)

### Using the fetchone() Method

In [ ]:
# cursor.execute("SELECT name FROM eurusd")
# cursor.fetchone()

## MySQL Where

Select With a Filter

When selecting records from a table, you can filter the selection by using the "WHERE" statement:

In [ ]:
cursor.execute("use moviesdb")

In [ ]:
cursor.execute("SHOW TABLES")
for x in cursor:
    print (x)

('actors',)
('financials',)
('languages',)
('movie_actor',)
('movies',)

In [ ]:
cursor.execute("SELECT * FROM actors")
result =cursor.fetchmany(5)

In [ ]:
cursor.fetchall() # clearing the the preceeding querry


sql="SELECT * FROM actors WHERE birth_year > 1990"
cursor. execute (sql)
result =cursor.fetchall()
for x in result:
    print (x)

(152, 'Darsheel Safary', 1997)
(170, 'Kiara Advani', 1991)

In [ ]:
cursor.description

[('actor_id', 3, None, None, None, None, 0, 16931, 63),
 ('name', 253, None, None, None, None, 0, 4097, 45),
 ('birth_year', 13, None, None, None, None, 1, 96, 63)]

### Wildcard Characters

You can also select the records that starts, includes, or ends with a given letter or phrase.

Use the %  to represent wildcard characters:

Names starting with "A"

In [ ]:
cursor.fetchall()

sql= "SELECT * FROM actors WHERE name LIKE '%s'"
cursor.execute(sql)
cursor.fetchall()

[(67, 'Tim Robbins', 1958),
 (95, 'Chris Evans', 1981),
 (160, 'Prabhas', 1979),
 (166, 'Tommy Lee Jones', 1946)]


Names ending  with "A"

In [ ]:
cursor.fetchall()

sql= "SELECT * FROM actors WHERE name LIKE 's%'"
cursor.execute(sql)
cursor.fetchall()

[(51, 'Sanjay Dutt', 1959),
 (59, 'Shah Rukh Khan', 1965),
 (63, 'Sharman Joshi', 1979),
 (82, 'Sam Worthington', 1976),
 (90, 'Sam Neill', 1947),
 (92, 'Song Kang-ho', 1967),
 (153, 'Sunil Dutt', 1929),
 (164, 'Salman Khan', 1965),
 (167, 'Sebastian Stan', 1982),
 (169, 'Sidharth Malhotra', 1985)]

Names containing "sa" anywhere

In [ ]:
cursor.fetchall()

sql= "SELECT * FROM actors WHERE name LIKE '%sa%'"
cursor.execute(sql)
cursor.fetchall()

[(51, 'Sanjay Dutt', 1959),
 (82, 'Sam Worthington', 1976),
 (83, 'Zoe Saldana', 1978),
 (90, 'Sam Neill', 1947),
 (152, 'Darsheel Safary', 1997),
 (164, 'Salman Khan', 1965)]

### MySQL Order By

Sort the Result

Use the ORDER BY statement to sort the result in ascending or descending order.

The ORDER BY keyword sorts the result ascending by default. To sort the result in descending order, use the DESC keyword.

Example

In [ ]:
cursor.fetchall()

cursor.execute("SELECT * FROM actors ORDER BY name")
cursor.fetchmany(5)

[(61, 'Aamir Khan', 1965),
 (85, 'Al Pacino', 1940),
 (156, 'Allu Arjun', 1982),
 (57, 'Amitabh Bachchan', 1942),
 (168, 'Anil Kapoor', 1956)]

In [ ]:
cursor.fetchall()

cursor.execute("SELECT * FROM actors ORDER BY name DESC")
cursor.fetchmany(5)

[(83, 'Zoe Saldana', 1978),
 (50, 'Yash', 1986),
 (75, 'Will Smith', 1968),
 (166, 'Tommy Lee Jones', 1946),
 (56, 'Tom Hiddleston', 1981)]

## Delete From By

Delete Record

You can delete records from an existing table by using the "DELETE FROM" statement:

In [ ]:
cursor.fetchall()
cursor.execute("use fx")

In [ ]:
# cursor.fetchall()

# cursor.execute(
#     "DELETE FROM eurusd WHERE name ='tsh'  "
#     )
# db.commit()
# print (cursor.rowcount, "rocord deleted")

## Prevent SQL Injection

It is considered a good practice to escape the values of any query, also in delete statements.

This is to prevent SQL injections, which is a common web hacking technique to destroy or misuse your database.

The mysql.connector module uses the placeholder %s to escape values in the delete statement:

In [ ]:
cursor.fetchall()

sql= "DELETE FROM EURUSD WHERE name=%s "
name= ('ksh',)
cursor.execute(sql, name)
db.commit()

In [ ]:
cursor.rowcount

31

## Delete a Table

You can delete an existing table by using the "DROP TABLE" statement:

In [ ]:
cursor.execute("DROP TABLE eurusd")

Drop Only if Exist

If the table you want to delete is already deleted, or for any other reason does not exist, you can use the IF EXISTS keyword to avoid getting an error.

In [ ]:
# cursor.execute("DROP TABLE IF EXISTS eurusd")

Update Table


You can update existing records in a table by using the "UPDATE" statement

In [ ]:
cursor. execute("UPDATE EURUSD set name ='MKC' WHERE name ='ksh' ")
db.commit()

Notice the WHERE clause in the UPDATE syntax: The WHERE clause specifies which record or records that should be updated. If you omit the WHERE clause, all records will be updated!

Important!: Notice the statement: mydb.commit(). It is required to make the changes, otherwise no changes are made to the table.

Prevent SQL Injection

It is considered a good practice to escape the values of any query, also in update statements.

This is to prevent SQL injections, which is a common web hacking technique to destroy or misuse your database.

The mysql.connector module uses the placeholder %s to escape values in the update statement:

In [ ]:
cursor.fetchall()

sql= "UPDATE EURUSD SET name = %s WHERE name = %s"
val= ('NRO','tsh')
cursor.execute(sql, val)
db.commit()

Limit

Limit the Result

You can limit the number of records returned from the query, by using the "LIMIT" statement:

In [41]:
cursor.execute("USE MOVIESDB")

In [ ]:
cursor.fetchall()
cursor.execute(
    "SELECT * FROM actors LIMIT 7")
cursor.fetchall()

[(50, 'Yash', 1986),
 (51, 'Sanjay Dutt', 1959),
 (52, 'Benedict Cumberbatch', 1976),
 (53, 'Elizabeth Olsen', 1989),
 (54, 'Chris Hemsworth', 1983),
 (55, 'Natalie Portman', 1981),
 (56, 'Tom Hiddleston', 1981)]

Start From Another Position
If you want to return five records, starting from the third record, you can use the "OFFSET" keyword:

In [ ]:
cursor.fetchall()
cursor.execute(
    "SELECT * FROM actors LIMIT 7 OFFSET 3")
cursor.fetchall()

[(53, 'Elizabeth Olsen', 1989),
 (54, 'Chris Hemsworth', 1983),
 (55, 'Natalie Portman', 1981),
 (56, 'Tom Hiddleston', 1981),
 (57, 'Amitabh Bachchan', 1942),
 (58, 'Jaya Bachchan', 1948),
 (59, 'Shah Rukh Khan', 1965)]

## converting to dataframe

In [ ]:
import pandas as pd
cursor.fetchall()
cursor.execute(
    "SELECT * FROM languages LIMIT 7 OFFSET 3")
data= cursor.fetchall()
columns= cursor.column_names

df= pd.DataFrame(data, columns=columns)

In [ ]:
print (df)

   language_id       name
0            8   Gujarati
1            3    Kannada
2            1   kiduruma
3            9  kiswahili
4            4      Tamil
5            2     Telugu

In [ ]:
cursor.fetchall()
cursor.execute("SELECT *FROM MOVIES")
results =cursor.fetchmany(5)
columns= cursor.column_names

df=pd.DataFrame(results, columns=columns)
df

,movie_id,title,industry,release_year,imdb_rating,studio,language_id
0,101,K.G.F: Chapter 2,Bollywood,2022,8.4,Hombale Films,3
1,102,Doctor Strange in the Multiverse of Madness,Hollywood,2022,7.0,Marvel Studios,5
2,103,Thor: The Dark World,Hollywood,2013,6.8,Marvel Studios,5
3,104,Thor: Ragnarok,Hollywood,2017,7.9,Marvel Studios,5
4,105,Thor: Love and Thunder,Hollywood,2022,6.8,Marvel Studios,5

In [ ]:
cursor.fetchall()
cursor.execute("Show tables")
for x in cursor:
    print (x)

('actors',)
('financials',)
('languages',)
('movie_actor',)
('movies',)

In [47]:
cursor.fetchall()
sql= """
SELECT *  
FROM languages 
INNER JOIN movies 
ON languages.language_id  = movies.language_id
"""
cursor.execute(sql)

results= cursor.fetchall()

columns= cursor.column_names

df=pd.DataFrame(results, columns=columns)
df.head()

,language_id,name,movie_id,title,industry,release_year,imdb_rating,studio,language_id
0,7,Bengali,127,Pather Panchali,Bollywood,1955,8.3,Government of West Bengal,7
1,5,English,102,Doctor Strange in the Multiverse of Madness,Hollywood,2022,7.0,Marvel Studios,5
2,5,English,103,Thor: The Dark World,Hollywood,2013,6.8,Marvel Studios,5
3,5,English,104,Thor: Ragnarok,Hollywood,2017,7.9,Marvel Studios,5
4,5,English,105,Thor: Love and Thunder,Hollywood,2022,6.8,Marvel Studios,5

In [54]:
# Outer join

cursor.fetchall()

sql="""
SELECT *
FROM movies 
LEFT JOIN languages 
ON
movies.language_id = languages.language_id

"""
cursor.execute(sql)

data =cursor.fetchall()
columns= cursor.column_names 
df= pd.DataFrame(data, columns=columns)
df.head()

,movie_id,title,industry,release_year,imdb_rating,studio,language_id,language_id,name
0,101,K.G.F: Chapter 2,Bollywood,2022,8.4,Hombale Films,3,3,Kannada
1,102,Doctor Strange in the Multiverse of Madness,Hollywood,2022,7.0,Marvel Studios,5,5,English
2,103,Thor: The Dark World,Hollywood,2013,6.8,Marvel Studios,5,5,English
3,104,Thor: Ragnarok,Hollywood,2017,7.9,Marvel Studios,5,5,English
4,105,Thor: Love and Thunder,Hollywood,2022,6.8,Marvel Studios,5,5,English

In [55]:
len(df)

39

In [56]:
len(df.columns)

9